Dlubal.RFEM5.IModelData
Interface for working with model data.

Dlubal.RFEM5.IModelData.GetType
Gets type of model.
Returns: Type of model

Dlubal.RFEM5.IModelData.SetType(System.UInt32)
Sets type of model.
Type: Type of model

Dlubal.RFEM5.IModelData.PrepareModification
Prepares application for data modification.

Dlubal.RFEM5.IModelData.FinishModification(System.Boolean)
Finishes data modification and updates the model.
CheckDuplicity: Check or don't check data duplicity.

Dlubal.RFEM5.IModelData.CancelModification
Cancels current data modification.

Dlubal.RFEM5.IModelData.IgnoreErrors(System.Boolean)
Ignores throwing exception while set values are invalid.
Ignore: Disable or disable throwing exception while set invalid data.

Dlubal.RFEM5.IModelData.EnableSelections(System.Boolean)
Allows you to work with selected objects only.
Enable: Enable/disable work with only selected objects.

Dlubal.RFEM5.IModelData.SelectObjects(System.UInt32,System.String)
Selects objects of specified type.
Type: Type of model objects.
List: List of objects No. to select. E.g.: "1,2,3"; "1-5"; "1-3,5"; "all".

Dlubal.RFEM5.IModelData.ConnectMembers(System.String)
Connects specified members.
MemberList: List of members to be connected together

Dlubal.RFEM5.IModelData.ConnectLines(System.String)
Connects specified lines.
LineList: List of lines to be connected together

Dlubal.RFEM5.IModelData.ConnectAll(System.String,System.String,System.String)
Connects specified objects.
LineList: List of lines to be connected together
MemberList: List of lines to be connected together
SurfaceList: List of lines to be connected together

Dlubal.RFEM5.IModelData.MoveSelectedObjects(System.UInt32@)
Moves selected objects.
Vector: Vector to selected objects move by

Dlubal.RFEM5.IModelData.CopySelectedObjects(System.UInt32@)
Copies selected objects.
Copy: Copy parameters

Dlubal.RFEM5.IModelData.RotateSelectedObjects(System.UInt32@)
Rotates and/or copies selected objects.
Rotate: Rotation parameters

Dlubal.RFEM5.IModelData.MirrorSelectedObjects(System.UInt32@)
Mirrors and/or copies selected objects.
Mirror: Mirror parameters

Dlubal.RFEM5.IModelData.ProjectSelectedObjects(System.UInt32@)
Projects and/or copies selected objects.
Project: Projection parameters

Dlubal.RFEM5.IModelData.ScaleSelectedObjects(System.UInt32@)
Scales selected objects with a factor.
Scale: Scale parameters

Dlubal.RFEM5.IModelData.ShearSelectedObjects(System.UInt32@)
Shears selected objects via angle.
Shear: Share parameters

Dlubal.RFEM5.IModelData.GetLastObjectNo(System.UInt32)
Gets number of last object.
Returns: Number of last object.
Type: Type of model object.

Dlubal.RFEM5.IModelData.Clean
Cleans model data.

Dlubal.RFEM5.IModelData.DeleteObjects(System.UInt32,System.String)
Deletes specified objects.
Type: Type of model objects.
List: List of objects No. to delete. E.g.: "1,2,3"; "1-5"; "1-3,5"; "all"

Dlubal.RFEM5.IModelData.SetObjectID(System.UInt32,System.Int32,System.UInt32,System.String)
Sets ID of the object.
Type: Type of model object.
No: Number or index of the object.
At: Specifies the type of access.
ID: New ID to be set.

Dlubal.RFEM5.IModelData.PlausibilityCheck(System.UInt32@)
Checks validity of model data.
Returns: Returns true if load case has no error, otherwise return false.
Error: Information about the error. If this parameter is set to null then no error occurred.

Dlubal.RFEM5.IModelData.GetIdenticalNodes(System.Double)
Gets array of identical nodes in the model.
Returns: Returns array of groups of identical nodes.
Tolerance: Tolerance in which the nodes are evaluated as identical. Default value is 0.0005 m.

Dlubal.RFEM5.IModelData.CorrectIdenticalNodes(System.UInt32,System.Double,System.String)
Corrects identical nodes in the model.
Correction: What to do with identical nodes.
Tolerance: Tolerance in which the nodes are evaluated as identical. Default value is 0.0005 m.
Group: Group of identical nodes which has to be corrected or empty string for all groups.

Dlubal.RFEM5.IModelData.GetMaterialDatabase
Gets interface for working with material database.
Returns: Material database interface.

Dlubal.RFEM5.IModelData.GetCrossSectionDatabase
Gets interface for working with cross-section database.
Returns: Material database interface.

Dlubal.RFEM5.IModelData.GetNodeCount
Gets count of nodes.
Returns: Count of nodes in the model.

Dlubal.RFEM5.IModelData.GetNode(System.Int32,System.UInt32)
Gets interface for working with node.
Returns: Node interface.
No: No. or index of the node you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetNode(System.UInt32@)
Sets node and returns it's interface.
Returns: Node interface
Node: Node parameters

Dlubal.RFEM5.IModelData.GetNodes
Gets array of nodes.
Returns: Array of nodes.

Dlubal.RFEM5.IModelData.SetNodes(System.UInt32@)
Sets array of nodes.
Nodes: Array of nodes to be set.

Dlubal.RFEM5.IModelData.GetLineCount
Gets count of lines.
Returns: Count of lines in the model.

Dlubal.RFEM5.IModelData.GetLine(System.Int32,System.UInt32)
Gets interface for working with line.
Returns: Line interface.
No: No. or index of the line you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetLine(System.UInt32@)
Sets line and returns it's interface.
Returns: Line interface.
Line: Line parameters.

Dlubal.RFEM5.IModelData.GetLines
Gets array of lines.
Returns: Array of lines.

Dlubal.RFEM5.IModelData.SetLines(System.UInt32@)
Sets array of lines.
Lines: Array of lines to be set.

Dlubal.RFEM5.IModelData.GetTrajectoryLineCount
Gets count of trajectory lines.
Returns: Count of trajectory lines in the model.

Dlubal.RFEM5.IModelData.GetTrajectoryLine(System.Int32,System.UInt32)
Gets interface for working with trajectory line.
Returns: Trajectory line interface.
No: No. or index of the line you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetTrajectoryLine(System.UInt32@)
Sets trajectory line and returns it's interface.
Returns: Trajectory line interface.
Line: Line parameters.

Dlubal.RFEM5.IModelData.GetTrajectoryLines
Gets array of trajectory lines.
Returns: Array of trajectory lines.

Dlubal.RFEM5.IModelData.SetTrajectoryLines(System.UInt32@)
Sets array of trajectory lines.
Lines: Array of trajectory lines to be set.

Dlubal.RFEM5.IModelData.GetLineOnSurfaceCount
Gets count of lines on surface.
Returns: Count of lines in the model.

Dlubal.RFEM5.IModelData.GetLineOnSurface(System.Int32,System.UInt32)
Gets interface for working with line on surface.
Returns: Line on surface interface.
No: No. or index of the line you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetLineOnSurface(System.UInt32@)
Sets line on surface and returns it's interface.
Returns: Line on surface interface.
Line: Line on surface parameters.

Dlubal.RFEM5.IModelData.GetLinesOnSurface
Gets array of lines on surface.
Returns: Array of lines on surface.

Dlubal.RFEM5.IModelData.SetLinesOnSurface(System.UInt32@)
Sets array of lines on surface.
Lines: Array of lines to be set.

Dlubal.RFEM5.IModelData.GetParabolaCount
Gets count of parabolas.
Returns: Count of parabolas in the model.

Dlubal.RFEM5.IModelData.GetParabola(System.Int32,System.UInt32)
Gets interface for working with parabola.
Returns: Parabola interface.
No: No. or index of the line you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetParabola(System.UInt32@)
Sets parabola and returns it's interface.
Returns: Parabola interface.
Line: Parabola parameters.

Dlubal.RFEM5.IModelData.GetParabolas
Gets array of parabolas.
Returns: Array of parabolas.

Dlubal.RFEM5.IModelData.SetParabolas(System.UInt32@)
Sets array of parabolas.
Lines: Array of parabolas to be set.

Dlubal.RFEM5.IModelData.GetNurbSplineCount
Gets count of NurbSpline.
Returns: Count of NurbSpline in the model.

Dlubal.RFEM5.IModelData.GetNurbSpline(System.Int32,System.UInt32)
Gets interface for working with NurbSpline.
Returns: NurbSpline interface.
No: No. or index of the NurbSpline you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetNurbSpline(System.UInt32@)
Sets NurbSpline and returns it's interface.
Returns: NurbSpline interface.
Line: NurbSpline parameters.

Dlubal.RFEM5.IModelData.GetNurbSplines
Gets array of NurbSpline.
Returns: Array of NurbSplines.

Dlubal.RFEM5.IModelData.SetNurbSplines(System.UInt32@)
Sets array of NurbSplines.
Lines: Array of NURBS to be set.

Dlubal.RFEM5.IModelData.GetMaterialCount
Gets the count of materials.
Returns: Count of materials in the model.

Dlubal.RFEM5.IModelData.GetMaterial(System.Int32,System.UInt32)
Gets interface for working with material.
Returns: Material interface.
No: No. or index of the material you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetMaterial(System.UInt32@)
Sets material and returns it's interface.
Returns: Material interface.
Material: Material parameters.

Dlubal.RFEM5.IModelData.GetMaterials
Gets array of materials.
Returns: Array of materials.

Dlubal.RFEM5.IModelData.SetMaterials(System.UInt32@)
Sets array of materials.
Materials: Array of materials to be set.

Dlubal.RFEM5.IModelData.GetSurfaceCount
Gets count of surfaces.
Returns: Count of surfaces in the model.

Dlubal.RFEM5.IModelData.GetSurface(System.Int32,System.UInt32)
Gets interface for working with surface.
Returns: Surface interface.
No: No. or index of the surface you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetSurface(System.UInt32@)
Sets surface and returns it's interface.
Returns: Surface interface
Surface: Surface parameters

Dlubal.RFEM5.IModelData.GetSurfaces
Gets array of surfaces.
Returns: Array of surfaces.

Dlubal.RFEM5.IModelData.SetSurfaces(System.UInt32@)
Sets array of surfaces.
Surfaces: Array of surfaces to be set.

Dlubal.RFEM5.IModelData.GetPlaneSurfaceCount
Gets count of plane surfaces.
Returns: Count of plane surfaces in the model.

Dlubal.RFEM5.IModelData.GetPlaneSurface(System.Int32,System.UInt32)
Gets interface for working with plane surface.
Returns: Surface interface.
No: No. or index of the plane surface you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetPlaneSurface(System.UInt32@)
Sets plane surface and returns it's interface.
Returns: Surface interface
Surface: Surface parameters

Dlubal.RFEM5.IModelData.GetPlaneSurfaces
Gets array of plane surfaces.
Returns: Array of plane surfaces.

Dlubal.RFEM5.IModelData.SetPlaneSurfaces(System.UInt32@)
Sets array of plane surfaces.
Surfaces: Array of plane surfaces to be set.

Dlubal.RFEM5.IModelData.GetQuadrangleSurfaceCount
Gets count of quadrangle surfaces.
Returns: Count of quadrangle surfaces in the model.

Dlubal.RFEM5.IModelData.GetQuadrangleSurface(System.Int32,System.UInt32)
Gets interface for working with quadrangle surface.
Returns: Surface interface.
No: No. or index of the quadrangle surface you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetQuadrangleSurface(System.UInt32@)
Sets quadrangle surface and returns it's interface.
Returns: Surface interface
Surface: Surface parameters

Dlubal.RFEM5.IModelData.GetQuadrangleSurfaces
Gets array of quadrangle surfaces.
Returns: Array of quadrangle surfaces.

Dlubal.RFEM5.IModelData.SetQuadrangleSurfaces(System.UInt32@)
Sets array of quadrangle surfaces.
Surfaces: Array of quadrangle surfaces to be set.

Dlubal.RFEM5.IModelData.GetBSplineSurfaceCount
Gets count of B-Spline surfaces.
Returns: Count of B-Spline surfaces in the model.

Dlubal.RFEM5.IModelData.GetBSplineSurface(System.Int32,System.UInt32)
Gets interface for working with B-Spline surface.
Returns: Surface interface.
No: No. or index of the B-Spline surface you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetBSplineSurface(System.UInt32@)
Sets B-Spline surface and returns it's interface.
Returns: Surface interface
Surface: Surface parameters

Dlubal.RFEM5.IModelData.GetBSplineSurfaces
Gets array of B-Spline surfaces.
Returns: Array of B-Spline surfaces.

Dlubal.RFEM5.IModelData.SetBSplineSurfaces(System.UInt32@)
Sets array of B-Spline Surfaces.
Surfaces: Array of quadrangle surfaces to be set.

Dlubal.RFEM5.IModelData.GetRotatedSurfaceCount
Gets count of rotated surfaces.
Returns: Count of rotated surfaces in the model.

Dlubal.RFEM5.IModelData.GetRotatedSurface(System.Int32,System.UInt32)
Gets interface for working with rotated surface.
Returns: Surface interface.
No: No. or index of the rotated surface you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetRotatedSurface(System.UInt32@)
Sets rotated surface and returns it's interface.
Returns: Surface interface
Surface: Surface parameters

Dlubal.RFEM5.IModelData.GetRotatedSurfaces
Gets array of rotated surfaces.
Returns: Array of rotated surfaces.

Dlubal.RFEM5.IModelData.SetRotatedSurfaces(System.UInt32@)
Sets array of rotated surfaces.
Surfaces: Array of rotated surfaces to be set.

Dlubal.RFEM5.IModelData.GetPipeSurfaceCount
Gets count of pipe surfaces.
Returns: Count of pipe surfaces in the model.

Dlubal.RFEM5.IModelData.GetPipeSurface(System.Int32,System.UInt32)
Gets interface to pipe surface.
Returns: Surface interface.
No: No. or index of the pipe surface you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetPipeSurface(System.UInt32@)
Sets pipe surface and returns it's interface.
Returns: Surface interface
Surface: Surface parameters

Dlubal.RFEM5.IModelData.GetPipeSurfaces
Gets array of pipe surfaces.
Returns: Array of pipe surfaces.

Dlubal.RFEM5.IModelData.SetPipeSurfaces(System.UInt32@)
Sets array of pipes.
Surfaces: Array of pipes to be set.

Dlubal.RFEM5.IModelData.GetTrajectorySurfaceCount
Gets count of trajectory surfaces.
Returns: Count of trajectory surfaces in the model.

Dlubal.RFEM5.IModelData.GetTrajectorySurface(System.Int32,System.UInt32)
Gets interface for working with trajectory surface.
Returns: Surface interface.
No: No. or index of the trajectory surface you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetTrajectorySurface(System.UInt32@)
Sets trajectory surface and returns it's interface.
Returns: Surface interface
Surface: Surface parameters

Dlubal.RFEM5.IModelData.GetTrajectorySurfaces
Gets array of trajectory surfaces.
Returns: Array of trajectory surfaces.

Dlubal.RFEM5.IModelData.SetTrajectorySurfaces(System.UInt32@)
Sets array of trajectory surfaces.
Surfaces: Array of trajectory surfaces to be set.

Dlubal.RFEM5.IModelData.GetNurbsSurfaceCount
Gets count of NURBS surfaces.
Returns: Count of NURBS surfaces in the model.

Dlubal.RFEM5.IModelData.GetNurbsSurface(System.Int32,System.UInt32)
Gets interface for working with NURBS surface.
Returns: Surface interface.
No: No. or index of the NURBS surface you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetNurbsSurface(System.UInt32@)
Sets NURBS surface and returns it's interface.
Returns: Surface interface
Surface: Surface parameters

Dlubal.RFEM5.IModelData.GetNurbsSurfaces
Gets array of NURBS surfaces.
Returns: Array of NURBS surfaces.

Dlubal.RFEM5.IModelData.SetNurbsSurfaces(System.UInt32@)
Sets array of NURBS surfaces.
Surfaces: Array of NURBS surfaces to be set.

Dlubal.RFEM5.IModelData.GetComponentSurfaceCount
Gets count of component surfaces.
Returns: Count of component surfaces in the model.

Dlubal.RFEM5.IModelData.GetComponentSurface(System.Int32,System.UInt32)
Gets interface for working with component surface.
Returns: Surface interface.
No: No. or index of the component surface you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetComponentSurface(System.UInt32@)
Sets component surface and returns it's interface.
Returns: Surface interface
Surface: Surface parameters

Dlubal.RFEM5.IModelData.GetComponentSurfaces
Gets array of component surfaces.
Returns: Array of component surfaces.

Dlubal.RFEM5.IModelData.SetComponentSurfaces(System.UInt32@)
Sets array of component surfaces.
Surfaces: Array of component surfaces to be set.

Dlubal.RFEM5.IModelData.GetSolidCount
Gets count of solids.
Returns: Count of solids in the model.

Dlubal.RFEM5.IModelData.GetSolid(System.Int32,System.UInt32)
Gets interface for working with solid.
Returns: Solid interface.
No: No. or index of the solid you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetSolid(System.UInt32@)
Sets solid and returns it's interface.
Returns: Solid interface
Solid: Solid parameters

Dlubal.RFEM5.IModelData.GetSolids
Gets array of solids.
Returns: Array of solids.

Dlubal.RFEM5.IModelData.SetSolids(System.UInt32@)
Sets array of solids.
Solids: Array of solids to be set.

Dlubal.RFEM5.IModelData.GetMaterialSolidCount
Gets count of material solids.
Returns: Count of material solids in the model.

Dlubal.RFEM5.IModelData.GetMaterialSolids
Gets array of material solids.
Returns: Array of material solid.

Dlubal.RFEM5.IModelData.GetGasSolidCount
Gets count of gas solids.
Returns: Count of gas solids in the model.

Dlubal.RFEM5.IModelData.GetGasSolid(System.Int32,System.UInt32)
Gets interface for working with gas solid.
Returns: Solid interface.
No: No. or index of the gas solid you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetGasSolid(System.UInt32@)
Sets gas solid and returns it's interface.
Returns: Solid interface
Solid: Solid parameters

Dlubal.RFEM5.IModelData.GetGasSolids
Gets array of gas solids.
Returns: Array of gas solid.

Dlubal.RFEM5.IModelData.SetGasSolids(System.UInt32@)
Sets array of gas solids.
Solids: Array of gas solids to be set.

Dlubal.RFEM5.IModelData.GetContactSolidCount
Gets count of contact solids.
Returns: Count of contact solids in the model.

Dlubal.RFEM5.IModelData.GetContactSolid(System.Int32,System.UInt32)
Gets interface for working with contact solid.
Returns: Solid interface.
No: No. or index of the contact solid you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetContactSolid(System.UInt32@)
Sets contact solid and returns it's interface.
Returns: Solid interface
Solid: Solid parameters

Dlubal.RFEM5.IModelData.GetContactSolids
Gets array of contact solids.
Returns: Array of contact solids.

Dlubal.RFEM5.IModelData.SetContactSolids(System.UInt32@)
Sets array of contact solids.
Solids: Array of contact solids to be set.

Dlubal.RFEM5.IModelData.GetNullSolidCount
Gets count of null solids.
Returns: Count of null solids in the model.

Dlubal.RFEM5.IModelData.GetNullSolids
Gets array of null solids.
Returns: Array of null solid.

Dlubal.RFEM5.IModelData.GetCompoundSolidCount
Gets count of compound solids.
Returns: Count of compound solids in the model.

Dlubal.RFEM5.IModelData.GetCompoundSolid(System.Int32,System.UInt32)
Gets interface for working with compound solid.
Returns: Solid interface.
No: No. or index of the compound solid you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetCompoundSolid(System.UInt32@)
Sets compound solid and returns it's interface.
Returns: Solid interface
Solid: Solid parameters

Dlubal.RFEM5.IModelData.GetCompoundSolids
Gets array of compound solids.
Returns: Array of compound solids.

Dlubal.RFEM5.IModelData.SetCompoundSolids(System.UInt32@)
Sets array of compound solids.
Solids: Array of compound solids to be set.

Dlubal.RFEM5.IModelData.GetOpeningCount
Gets count of openings.
Returns: Count of openings in the model.

Dlubal.RFEM5.IModelData.GetOpening(System.Int32,System.UInt32)
Gets interface for working with opening.
Returns: Opening interface.
No: No. or index of the opening you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetOpening(System.UInt32@)
Sets opening and returns it's interface.
Returns: Opening interface
Opening: Opening parameters

Dlubal.RFEM5.IModelData.GetOpenings
Gets array of openings.
Returns: Array of openings.

Dlubal.RFEM5.IModelData.SetOpenings(System.UInt32@)
Sets array of openings.
Openings: Array of openings to be set.

Dlubal.RFEM5.IModelData.GetNodalSupportCount
Gets the count of nodal supports.
Returns: Count of nodal support in the model.

Dlubal.RFEM5.IModelData.GetNodalSupport(System.Int32,System.UInt32)
Gets interface for working with nodal support.
Returns: Nodal support interface.
No: No. or index of the nodal support you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetNodalSupport(System.UInt32@)
Sets nodal support and returns it's interface.
Returns: Nodal support interface.
Support: Nodal support parameters.

Dlubal.RFEM5.IModelData.GetNodalSupports
Gets array of nodal supports.
Returns: Array of nodal supports.

Dlubal.RFEM5.IModelData.SetNodalSupports(System.UInt32@)
Sets array of nodal supports.
Supports: Array of nodal supports to be set.

Dlubal.RFEM5.IModelData.GetLineSupportCount
Gets the count of line supports.
Returns: Count of line support in the model.

Dlubal.RFEM5.IModelData.GetLineSupport(System.Int32,System.UInt32)
Gets interface for working with line support.
Returns: Line support interface.
No: No. or index of the line support you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetLineSupport(System.UInt32@)
Sets line support and returns it's interface.
Returns: Line support interface.
Support: Line support parameters.

Dlubal.RFEM5.IModelData.GetLineSupports
Gets array of line supports.
Returns: Array of line supports.

Dlubal.RFEM5.IModelData.SetLineSupports(System.UInt32@)
Sets array of line supports.
Supports: Array of line supports to be set.

Dlubal.RFEM5.IModelData.GetSurfaceSupportCount
Gets the count of surface supports.
Returns: Count of surface support in the model.

Dlubal.RFEM5.IModelData.GetSurfaceSupport(System.Int32,System.UInt32)
Gets interface for working with surface support.
Returns: Surface support interface.
No: No. or index of the surface support you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetSurfaceSupport(System.UInt32@)
Sets surface support and returns it's interface.
Returns: Surface support interface.
Support: Surface support parameters.

Dlubal.RFEM5.IModelData.GetSurfaceSupports
Gets array of surface supports.
Returns: Array of surface supports.

Dlubal.RFEM5.IModelData.SetSurfaceSupports(System.UInt32@)
Sets array of surface supports.
Supports: Array of surface supports to be set.

Dlubal.RFEM5.IModelData.GetLineHingeCount
Gets the count of line hinge.
Returns: Count of line hinges in the model.

Dlubal.RFEM5.IModelData.GetLineHinge(System.Int32,System.UInt32)
Gets interface for working with line hinge.
Returns: Line hinge interface.
No: No. or index of the line hinge you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetLineHinge(System.UInt32@)
Sets line hinge and returns it's interface.
Returns: Line hinge interface.
Hinge: Line hinge parameters.

Dlubal.RFEM5.IModelData.GetLineHinges
Gets array of line hinges.
Returns: Array of line hinges.

Dlubal.RFEM5.IModelData.SetLineHinges(System.UInt32@)
Sets array of line hinges.
Hinges: Array of line hinges to be set.

Dlubal.RFEM5.IModelData.GetCrossSectionCount
Gets the count of cross-sections.
Returns: Count of cross-section in the model.

Dlubal.RFEM5.IModelData.GetCrossSection(System.Int32,System.UInt32)
Gets interface for working with cross-section.
Returns: Cross-section interface.
No: No. or index of the cross-section you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetCrossSection(System.UInt32@)
Sets cross-section and returns it's interface.
Returns: Cross-section interface.
CrossSection: Cross-section parameters.

Dlubal.RFEM5.IModelData.GetCrossSections
Gets array of cross-sections.
Returns: Array of cross-sections.

Dlubal.RFEM5.IModelData.SetCrossSections(System.UInt32@)
Sets array of cross-sections.
CrossSections: Array of cross-sections to be set.

Dlubal.RFEM5.IModelData.GetMemberHingeCount
Gets the count of member hinges.
Returns: Count of member hinges in the model.

Dlubal.RFEM5.IModelData.GetMemberHinge(System.Int32,System.UInt32)
Gets interface for working with member hinge.
Returns: Member hinge interface.
No: No. or index of the member hinge you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetMemberHinge(System.UInt32@)
Sets member hinge and returns it's interface.
Returns: Member hinge interface.
Hinge: Member hinge parameters.

Dlubal.RFEM5.IModelData.GetMemberHinges
Gets array of member hinges.
Returns: Array of member hinges.

Dlubal.RFEM5.IModelData.SetMemberHinges(System.UInt32@)
Sets array of member hinges.
Hinges: Array of member hinges to be set.

Dlubal.RFEM5.IModelData.GetMemberEccentricityCount
Gets count of member eccentricities.
Returns: Count of member eccentricities in the model.

Dlubal.RFEM5.IModelData.GetMemberEccentricity(System.Int32,System.UInt32)
Gets interface for working with member eccentricity.
Returns: Eccentricity interface.
No: No. or index of the member eccentricity you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetMemberEccentricity(System.UInt32@)
Sets member eccentricity and returns it's interface.
Returns: Member eccentricity interface.
Eccentricity: Member eccentricity parameters.

Dlubal.RFEM5.IModelData.GetMemberEccentricities
Gets array of member eccentricities.
Returns: Array of member eccentricities.

Dlubal.RFEM5.IModelData.SetMemberEccentricities(System.UInt32@)
Sets array of member eccentricities.
Eccentricities: Array of member eccentricities to be set.

Dlubal.RFEM5.IModelData.GetMemberDivisionCount
Gets the count of member divisions.
Returns: Count of member division in the model.

Dlubal.RFEM5.IModelData.GetMemberDivision(System.Int32,System.UInt32)
Gets interface for working with member division.
Returns: Member division interface.
No: No. or index of the member division you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetMemberDivision(System.UInt32@)
Sets member division and returns it's interface.
Returns: Member division interface.
Division: Member division parameters.

Dlubal.RFEM5.IModelData.GetMemberDivisions
Gets array of member divisions.
Returns: Array of member divisions.

Dlubal.RFEM5.IModelData.SetMemberDivisions(System.UInt32@)
Sets array of member divisions.
Divisions: Array of member divisions to be set.

Dlubal.RFEM5.IModelData.GetMemberCount
Gets count of members.
Returns: Count of members in the model.

Dlubal.RFEM5.IModelData.GetMember(System.Int32,System.UInt32)
Gets interface for working with member.
Returns: Member interface.
No: No. or index of the member you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetMember(System.UInt32@)
Sets member and returns it's interface.
Returns: Member interface.
Member: Member parameters.

Dlubal.RFEM5.IModelData.GetMembers
Gets array of members.
Returns: Array of members.

Dlubal.RFEM5.IModelData.SetMembers(System.UInt32@)
Sets array of members.
Members: Array of members to be set.

Dlubal.RFEM5.IModelData.GetRibCount
Gets count of ribs.
Returns: Count of ribs in the model.

Dlubal.RFEM5.IModelData.GetRib(System.Int32,System.UInt32)
Gets interface for working with rib.
Returns: Rib interface.
No: No. or index of the rib you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetRib(System.UInt32@)
Sets rib and returns it's interface.
Returns: Rib interface.
Rib: Rib parameters.

Dlubal.RFEM5.IModelData.GetRibs
Gets array of ribs.
Returns: Array of ribs.

Dlubal.RFEM5.IModelData.SetRibs(System.UInt32@)
Sets array of ribs.
Ribs: Array of ribs to be set.

Dlubal.RFEM5.IModelData.GetMemberElasticFoundationCount
Gets the count of member elastic foundations.
Returns: Count of member elastic foundation in the model.

Dlubal.RFEM5.IModelData.GetMemberElasticFoundation(System.Int32,System.UInt32)
Gets interface for working with member elastic foundation.
Returns: Member elastic foundation interface.
No: No. or index of the member elastic foundation you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetMemberElasticFoundation(System.UInt32@)
Sets member elastic foundation and returns it's interface.
Returns: Member elastic foundation interface.
Foundation: Member elastic foundation parameters.

Dlubal.RFEM5.IModelData.GetMemberElasticFoundations
Gets array of member elastic foundations.
Returns: Array of member elastic foundations.

Dlubal.RFEM5.IModelData.SetMemberElasticFoundations(System.UInt32@)
Sets array of member elastic foundations.
Foundations: Array of member elastic foundation to be set.

Dlubal.RFEM5.IModelData.GetMemberNonlinearityCount
Gets the count of member nonlinearities.
Returns: Count of member nonlinearities in the model.

Dlubal.RFEM5.IModelData.GetMemberNonlinearity(System.Int32,System.UInt32)
Gets interface for working with member nonlinearity.
Returns: Member nonlinearity interface.
No: No. or index of the member nonlinearity you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetMemberNonlinearity(System.UInt32@)
Sets member nonlinearity and returns it's interface.
Returns: Member nonlinearity interface.
Nonlinearity: Member nonlinearity parameters.

Dlubal.RFEM5.IModelData.GetMemberNonlinearities
Gets array of member nonlinearities.
Returns: Array of member nonlinearities.

Dlubal.RFEM5.IModelData.SetMemberNonlinearities(System.UInt32@)
Sets array of member nonlinearities.
Nonlinearities: Array of member nonlinearities to be set.

Dlubal.RFEM5.IModelData.GetSetOfMembersCount
Gets the count of sets of members.
Returns: Count of set of members in the model.

Dlubal.RFEM5.IModelData.GetSetOfMembers(System.Int32,System.UInt32)
Gets interface for working with set of members.
Returns: Set of members interface.
No: No. or index of the set of members you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetSetOfMembers(System.UInt32@)
Sets set of members and returns it's interface.
Returns: Set of members interface.
Set: Set of members parameters.

Dlubal.RFEM5.IModelData.GetSetsOfMembers
Gets array of sets of members.
Returns: Array of sets of members.

Dlubal.RFEM5.IModelData.SetSetsOfMembers(System.UInt32@)
Sets array of sets of members.
Sets: Array of sets of members to be set.

Dlubal.RFEM5.IModelData.GetIntersectionOfSurfacesCount
Gets the count of intersections of surfaces.
Returns: Count of intersections of surfaces in the model.

Dlubal.RFEM5.IModelData.GetIntersectionOfSurfaces(System.Int32,System.UInt32)
Gets interface to intersection.
Returns: Intersection of surfaces interface.
No: No. or index of the intersection of surfaces you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetIntersectionOfSurfaces(System.UInt32@)
Sets intersection of surfaces and returns it's interface.
Returns: Intersection of surfaces interface.
Intersection: Intersection of surfaces parameters.

Dlubal.RFEM5.IModelData.GetIntersectionsOfSurfaces
Gets array of intersections of surfaces.
Returns: Array of intersections of surfaces.

Dlubal.RFEM5.IModelData.SetIntersectionsOfSurfaces(System.UInt32@)
Sets array of intersections of surfaces.
Intersections: Array of intersections of surfaces to be set.

Dlubal.RFEM5.IModelData.GetFeMeshRefinementCount
Gets the count of FE-Mesh refinements.
Returns: Count of FE-Mesh refinements in the model.

Dlubal.RFEM5.IModelData.GetFeMeshRefinement(System.Int32,System.UInt32)
Gets interface for working with FE-Mesh refinement.
Returns: FE-Mesh refinement interface.
No: No. or index of the FE-Mesh refinement you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetFeMeshRefinement(System.UInt32@)
Sets FE-Mesh refinement and returns it's interface.
Returns: FE-Mesh refinement interface.
Refinement: FE-Mesh refinement parameters.

Dlubal.RFEM5.IModelData.GetFeMeshRefinements
Gets array of FE-Mesh refinements.
Returns: Array of FE-Mesh refinements.

Dlubal.RFEM5.IModelData.SetFeMeshRefinements(System.UInt32@)
Sets array of FE-Mesh refinements.
Refinements: Array of FE-Mesh refinements to be set.

Dlubal.RFEM5.IModelData.GetNodalReleaseCount
Gets the count of nodal releases.
Returns: Count of nodal release in the model.

Dlubal.RFEM5.IModelData.GetNodalRelease(System.Int32,System.UInt32)
Gets interface for working with nodal release.
Returns: Nodal release interface.
No: No. or index of the nodal release you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetNodalRelease(System.UInt32@)
Sets nodal release and returns it's interface.
Returns: Nodal release interface.
Release: Nodal release parameters.

Dlubal.RFEM5.IModelData.GetNodalReleases
Gets array of nodal releases.
Returns: Array of nodal releases.

Dlubal.RFEM5.IModelData.SetNodalReleases(System.UInt32@)
Sets array of nodal releases.
Releases: Array of nodal releases to be set.

Dlubal.RFEM5.IModelData.GetLineReleaseTypeCount
Gets the count of line releases type.
Returns: Count of line release type in the model.

Dlubal.RFEM5.IModelData.GetLineReleaseType(System.Int32,System.UInt32)
Gets interface for working with line release type.
Returns: Line release type interface.
No: No. or index of the line release type you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetLineReleaseType(System.UInt32@)
Sets line release type and returns it's interface.
Returns: Line release type interface.
Type: Line release type parameters.

Dlubal.RFEM5.IModelData.GetLineReleaseTypes
Gets array of line release types.
Returns: Array of line release types.

Dlubal.RFEM5.IModelData.SetLineReleaseTypes(System.UInt32@)
Sets array of line release types.
Types: Array of line release types to be set.

Dlubal.RFEM5.IModelData.GetLineReleaseCount
Gets the count of line releases.
Returns: Count of line release in the model.

Dlubal.RFEM5.IModelData.GetLineRelease(System.Int32,System.UInt32)
Gets interface for working with line release.
Returns: Line release interface.
No: No. or index of the line release you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetLineRelease(System.UInt32@)
Sets line release and returns it's interface.
Returns: Line release interface.
Release: Line release parameters.

Dlubal.RFEM5.IModelData.GetLineReleases
Gets array of line releases.
Returns: Array of line releases.

Dlubal.RFEM5.IModelData.SetLineReleases(System.UInt32@)
Sets array of line releases.
Releases: Array of line releases to be set.

Dlubal.RFEM5.IModelData.GetConnectionEccentricityCount
Gets count of connection eccentricities.
Returns: Count of connection eccentricities in the model.

Dlubal.RFEM5.IModelData.GetConnectionEccentricity(System.Int32,System.UInt32)
Gets interface for working with connection eccentricity.
Returns: Eccentricity interface.
No: No. or index of the connection eccentricity you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetConnectionEccentricity(System.UInt32@)
Sets connection eccentricity and returns it's interface.
Returns: Connection eccentricity interface.
Eccentricity: Connection eccentricity parameters.

Dlubal.RFEM5.IModelData.GetConnectionEccentricities
Gets array of connection eccentricities.
Returns: Array of connection eccentricities.

Dlubal.RFEM5.IModelData.SetConnectionEccentricities(System.UInt32@)
Sets array of connection eccentricities.
Eccentricities: Array of connection eccentricities to be set.

Dlubal.RFEM5.IModelData.GetConnectionOfTwoMembersCount
Gets the count of connections of two members.
Returns: Count of connections of two members in the model.

Dlubal.RFEM5.IModelData.GetConnectionOfTwoMembers(System.Int32,System.UInt32)
Gets interface for working with connection of two members.
Returns: Connection of two members interface.
No: No. or index of the connection of two members you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetConnectionOfTwoMembers(System.UInt32@)
Sets connection of two members and returns it's interface.
Returns: Connection of two members interface.
Connection: Connection of two members parameters.

Dlubal.RFEM5.IModelData.GetConnectionsOfTwoMembers
Gets array of connections of two members.
Returns: Array of connections of two members.

Dlubal.RFEM5.IModelData.SetConnectionsOfTwoMembers(System.UInt32@)
Sets array of connections of two members.
Connections: Array of connections of two members to be set.

Dlubal.RFEM5.IModelData.GetTendonCount
Gets count of tendons.
Returns: Count of tendons in the model.

Dlubal.RFEM5.IModelData.GetTendon(System.Int32,System.UInt32)
Gets interface for working with tendon.
Returns: Tendon interface.
No: No. or index of the tendon you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IModelData.SetTendon(System.UInt32@)
Sets tendon and returns it's interface.
Returns: Tendon interface.
Tendon: Tendon parameters.

Dlubal.RFEM5.IModelData.GetTendons
Gets array of tendons.
Returns: Array of tendons.

Dlubal.RFEM5.IModelData.SetTendons(System.UInt32@)
Sets array of tendons.
Tendons: Array of tendons to be set.